{
    "About Us" : {
        "Our Story": "Grace Baptist Church was founded on June 30, 1912 with 21 German immigrants. The church community spoke German and was known as “Deutsche Baptisten Geminde” – the German Baptist Church. In 1941 the name was changed to Riverside Baptist, and later to Bridgeland Baptist. The founders’ pioneering spirits live on in the fact that it is the mother or grandmother church of all NAB Churches in the city of Calgary – a total of 9.The church has been through five building projects and relocations. The first was a small building located on Marsh Road N.E. In 1940 a second building was established on 8th Street N.E. and a third in 1952 on the same site. In 1975, Grace Baptist relocated and a fourth building was established on Maryvale Drive N.E., with a seating capacity of about 450 people. The church community grew and the facilities quickly became inadequate.The present facility, located at 2670 Radcliffe Drive S.E., overlooks the city core on Memorial Drive. Adjacent to the Franklin Street LRT station, it was built in 1989. In the fall of 2000, the church began a building program to construct additional space including another chapel, a youth centre, conference facilities, and many classrooms for children and families.The goal of our current facility is to help create an environment that inspires us to love and live like Jesus in our building, in our community, in our city and in our world.",
        "Our Staff": {
            "LEAD PASTOR" : {
                "name" : "Harry Kelm",
                "description": "Pastor Harry joined Grace Baptist Church in 2006. Pastor Harry believes the best decision he ever made was to ask his wife Cindy to marry him. They have three children and one daughter-in-law: Sara, Lucas and his wife Tamara and Lauren.  Harry and Cindy enjoy taking walks together, traveling and visiting their kids.  Harry is also an avid bicycler and enjoys the bike paths of Calgary. \nPastor Harry is the staff leader and the primary preacher in our Sunday morning Worship Services.  He also provides leadership to the day to day running of Grace Baptist and seeks to discern God's will and direction for Grace Baptist.  Pastor Harry is passionate about drawing people to God through God's Word and helping people find their place in the Kingdom of God.",
                "email": "hkelm@gbccalgary.com",
                "profile": "http://gbccalgary.com/wp-content/uploads/2014/04/harry-and-cindy-300x199.jpg"
            },
        },
        "Our Beliefs": {
            "STATEMENT OF FAITH – Grace Baptist Church (Taken from GBC Constitution)": ""
            "Revelation" : "Special Revelation.  We believe that the Bible is God’s special revelation, the Word of God.  We believe in the verbal inspiration of the Bible in its entirety, by the Holy Spirit, rendering the Bible inerrant in the original autographs in all that it affirms. We believe the Word of God has supreme authority in all matters of faith and conduct.  John 17:17; Roman 15:4; II Timothy 3:16,17; II Peter 1:19-21. General Revelation. We believe that God has also revealed Himself in conscience, creation and providential history, but this general revelation does not impart saving truths, and must be interpreted by the testimony of God’s authoritative special revelation, the Word of God. Psalm 19; Job 12:7-9; Romans 1:19, 20; 10:18.",
            "Humanity": "We believe that mankind was created in the image of God, in man’s personality (moral responsibility and intelligence) and in his knowledge of God and of His will for man. We believe that man has fallen from his original state of innocence and that all men are sinners by nature and by choice, and under condemnation by God. Genesis 1:27; 5:1",
            "Christian conduct": "We believe that the Christian should live for the glory of God and the well-being of all people. He should be a faithful steward of his possessions, time, and talents, his conduct should be a good testimony before the world and he should seek to realize for himself and others the full stature of maturity in Christ. II Corinthians 9:6-8; Ephesians 4:11-16; Philippians 2:14-16.",
            "Angelic Beings": "We believe in angels, created ministering spirits sent to serve those who will inherit salvation and to be God’s messengers, and ambassadors. Psalm 148:2-5; Colossians 1:16; Hebrews 1:14.We believe that Satan and his demons are fallen, apostate angels who are the chief antagonists of God and man, and promote every form of evil in the universe, ultimately to be consigned forever to eternal punishment. Job 1:12,13, 19; 2:7; Daniel 10:12,13; Matthew 4:3; 25:41; Luke 13:11,16; John 13:27; Acts 10:38; Romans 8:38,39; II Corinthians 12:7; I Peter 5:8; II Peter 2:4; Jude 6.",
            "Our Mission Statement and Core Values": "Our Mission Statement: Love and Live Like Jesus \nLove Like Jesus:  Loving God, Loving Others \n Live Like Jesus:  Living in Sacrificial Service, Living in Obedient Faithfulness \n\n Our Core Values: \nWe Value Biblical Truth \nWe Value Community \nWe Value Service",
            "The Trinity": "We believe that there is one living and true God, co-equally and co-eternally existing in three Persons: Father, Son and Holy Spirit, that these are a trinity, equal in every Divine perfection of spirituality, personality, omniscience, omnipotence, omnipresence, independence, and immutability, and that they execute distinct but harmonious offices in the work of creation, providence and redemption. Matthew 28:19; John 1:1-4; Hebrews 9:14; I Peter 1:2.\n God the Father \n We believe in God the Father, the first Person of the Trinity. The Father sends the Son and the Holy Spirit. (Galatians 4:4; John 15:26) We believe that He concerns Himself mercifully in the affairs of men, that He hears and answers prayer, and that He saves from sin and death all who come to Him through Jesus Christ. John 3:16,17; 4:24; 17:5; Acts 4:12; 10:43; I Timothy 2:5. \n Jesus Christ \n We believe in Jesus Christ, God’s only begotten son, the second Person of the Trinity. We believe in His true humanity and true deity. He was conceived by the Holy Spirit, born of a virgin, lived a sinless life, performed miracles and taught authoritatively the Word of God. We believe in His substitutionary, atoning death, in His bodily resurrection, in His ascension into Heaven, in His perpetual advocacy for His people, and His personal, visible return to earth.  Isaiah 7:14; John 1:14; Philippians 2:5-11; Hebrews 1:2,3 and I John 1:7; I Corinthians 15:3,4; II Corinthians 5:21. \n Holy Spirit \n We believe in the Holy Spirit, the third Person of the Trinity who came forth from the Father and Son to convict the world of sin, righteousness and judgment, and to regenerate, sanctify, and empower all who believe in Jesus Christ. We believe that the Holy Spirit indwells every believer in Christ and that He is an abiding helper, teacher and guide. John 14:26; John 16:7-15; Romans 8:14-17; Ephesians 1:13,14.",
            "Salvation": "We believe that salvation brings sinful persons into right relationship with a holy God. Salvation is a gift of God that is received through repentance and faith in Jesus Christ. Salvation involves regeneration by the Holy Spirit, justification in the sight of God, and adoption into the family of God. Salvation is through Christ alone, not by human effort. John 1:12,13; John 3:3,16,17; Acts 20:21; Ephesians 2:1-9; Titus 3:5; John 14:6; Acts 4:12.",
            "Marriage and Family": "We believe the Bible teaches that marriage refers to a covenant relationship between one man and one woman, as instituted by God in the beginning, to the exclusion of all others. Genesis 2:20b-24; 1 Corinthians 7:2; Hebrews 13:4 We affirm the family as the basic unit of society and seek to preserve its integrity and stability. Genesis2:21-25; Ephesians 6:1-4",
            "Religious Liberty": "We believe that every human being has direct relations with God and is responsible to God alone in all matters of faith (Matthew 6:21,24; 7:21-23; 12:36,37), that each church is independent and must be free from interference by any ecclesiastical or political authority (Matthew 22:21; Mark 12:17; Luke 20:25; Acts 4:12; Romans 13:1-7; I Timothy 2:1-5; Hebrews 4:16; 9:11-28; 10), that church and state must therefore be kept separate as having different functions, each fulfilling its duties free from dictation or patronage of the other (Acts 4:19; 5:29).",
            "Creation": "We believe that the triune God is the source of all that there is. The entire universe was created by God ex nihilo (out of nothing). God creates in freedom and with purpose. Creation is the stage on which are enacted God’s dealings with mankind. Providence is God’s gracious outworking of His purpose in Christ which issues in His dealings with mankind. Providence also bears witness to God among the heathen. God preserves and cares for His creation in His common grace, restraining sin within human society, and allowing mankind, though fallen, to live together in a generally orderly and cooperative manner, to show mutual forbearance, and to cultivate together the scientific, cultural, and economic pursuits of civilization. Genesis 1:26; Colossians 1:16; Hebrew 11:3; II Thessalonians 2:7.",
            "The Church": "We believe in the universal church, a living spiritual body of which Christ is the Head and all regenerated persons the members. We believe in the local church, consisting of a company of believers in Jesus Christ, baptized on a credible profession of faith, and associated for worship, service and fellowship. We believe that God has laid upon the members of the local church the primary task of proclaiming the Gospel of Jesus Christ to a lost world, and discipling believers. Matthew 15:16-18; Acts 2:38-41; Ephesians 2:19-22; 5:25-27.",
            "Ordinances": "We believe that the Lord Jesus Christ has committed two ordinances to the local church, which should be observed and administered until the return of the Lord Jesus Christ. \nBaptism: We believe that Christian baptism is the immersion of a believer in water in the name of the triune God. Matthew 3:13-16; Matthew 28:19; Romans 6:3,4. \nLord’s Supper: We believe that the Lord’s Supper was instituted by Christ for commemoration of His death and anticipation of His return. I Corinthians 11: 23-32",
            "Last Things": "We believe in the personal and visible return of the Lord Jesus Christ to earth and the establishment of His kingdom. We believe in the resurrection of the body, the final judgment, the eternal bliss of the justified and the endless suffering of the lost. Matthew 25:31-46; John 5:28-29; 14:1-4; Acts 1:11; II Corinthians 5:10; I Thessalonians 4:13-18; Revelation 20:1-16."
        }
    },
}
